//#region src/data/projects/17.md?raw
var _17_default = "## Описание\r\n\r\n\"Musqt\" - это мультиплеерный шутер на небольших аренах (летающих островах). Всего есть два режима: командный и один против всех. Основная механика - выстрел из однозарядного мушкета, который не убивает, а отбрасывает игрока на значительное расстояние. Цель - скинуть соперника с острова, но при этом не упасть самому. Игроки перерождаются после падения, но каждый сброс приносит очки. Матч длится до определённого количества очков или по времени.\r\n\r\n## Разработка\r\n\r\nЯ просто стырил эту идею с режима из \"Rec Room\".\r\n";
//#endregion
export { _17_default as default };
