//#region src/data/projects/19.md?raw
var _19_default = "## Описание\r\n\r\nТы - обычный бомж, жилец отеля. Твоя задача - выжить пять ночей. Но чтобы дожить до утра, придётся использовать камеры наблюдения, двери, свет и собственную смекалку. Дед не остановится ни перед чем. И помни: \"Пацаны, тревога! Дед сбежал!\" - эту фразу ты будешь слышать в своей голове каждую ночь.\r\n\r\n## Разработка\r\n\r\nУвидел эту гениальную анимацию и подумал, что будет круто превратить это в хоррор игру.\r\n";
//#endregion
export { _19_default as default };
