//#region src/data/news/1.md?raw
var _1_default = "---\r\ntheme: \"Первая статья\"\r\npreview: \"news1.png\"\r\n---\r\n\r\nВсяям пливееет эта мойна первана статьямана\r\n\r\nТут я будумана тестироватамана парсермана этавамана сайтамана ДОД?\r\n\r\n# Вот такая главенька глава естьмана\r\n\r\nШтобы так делать нада ставить решоточку как на терьменама\r\n\r\n## Эта решетка двамана\r\n\r\nИ так тоже можнамана делать тока два штуки сразумана\r\n\r\n**Толстееный сисястый** шрифт такой мана звёздачки па бакавинам\r\n\r\n_Италический карявый_ щрифт манатама шишползуя прабелеми по боковонамана\r\n\r\nА тут есть\r\nЭта май рандой младший брат и брун\r\n[news1.png]\r\n";
//#endregion
export { _1_default as default };
