//#region src/data/projects/23.md?raw
var _23_default = "## Описание\r\n\r\nЭто первая публичная демонстрация движка Voltage (первой версии). Самая простая игра, которую только можно придумать. Но именно она должна была доказать, что движок Voltage уже существует и способен на что-то.\r\n\r\n## Разработка\r\n\r\nНа тот момент Voltage был набором функций без структуры: пара процедур для вывода текста, зачатки ввода, заготовка таймера. Не было ни рендера, ни сцен, ни ресурсов. Была только консоль - чёрный экран с сеткой символов, который в те годы был единственным способом что-то показать на экране. Никаких интерфейсов, никаких окон, никаких курсоров. Только буфер консоли - массив символов в памяти, который выводится на экран целиком.\r\n";
//#endregion
export { _23_default as default };
