//#region src/data/projects/24.md?raw
var _24_default = "## Описание\r\n\r\nЭто техническая демонстрация, созданная для того, чтобы показать текущие возможности самописного движка Voltage. Это не коммерческий проект и не попытка переизобрести классику. Этот проект проверяет рендер, ввод, звук, UI, сохранения и игровой цикл на простом жанре.\r\n\r\n## Разработка\r\n\r\nVoltage на момент начала работы представлял собой набор разрозненных модулей: рендер, ввод, аудио, ресурсы. Не хватало цельного проекта, который бы связал их воедино. Тетрис стал этим проектом. Интересный факт: нижняя часть интерфейса - пол, был взят из скриншота игры \"Greedy Christmas 2\".\r\n";
//#endregion
export { _24_default as default };
