import { b as unescapeHTML, d as maybeRenderHead, u as renderTemplate } from "./server_Cu3e08uR.mjs";
import { t as createComponent } from "./global_Ckd2dsnF.mjs";
//#region src/data/news/2.md
var html = () => "<p>После альфа версии (оригинальной TCOS с лабиринтами) планировалась полная переделка под пародию на “PT”: повторяющиеся переходы, скримеры и новые проходы для решения тех или иных головоломок. После года разработки, выяснилось, что для простой пародии на “PT” было сделано слишком много, а игра перестала быть похожей на оригинал. В связи с этим я принял решение перенести эти наработки для проекта “Unwanted” как долгострой (в частности карту дома). После ещё одного года (работа производилась уже как над “Unwanted”), было решено всё таки оформить её как самостоятельный проект с новым названием - “Dome Shae”. В конце концов, после такого путешествия между проектами, “TCOS” возвращается ко своей изначальной задумке - абстрактный визуал и бесконечные лабиринты. В будущем предстоит переписать этот проект на нашем собственном движке -“Voltage”, а визуальная составляющая будет переделана в 2.5D.</p>\n<p>Была мысль в Dome Shae сделать геймплей, где мы играем за Масленникова, ищем паранормальное и снимаем материалы, чтобы продавать их на чёрном рынке. Это предполагало нахождение не только в доме, но и за его пределами: лес, заброшенные здания, стройки…</p>\n<p>Интересный факт: для обложки релиза Tensor Kinect - Vintage использовался скриншот из этой игры (Dome Shae).</p>\n<p>[tensor.png]</p>\n";
var frontmatter = {
	"theme": "Путь TCOS",
	"preview": "news2.png"
};
var file = "D:/Files/Dev/Web/Tamati/src/data/news/2.md";
var url = void 0;
function rawContent() {
	return "   \r\n                  \r\n                    \r\n   \r\n\r\nПосле альфа версии (оригинальной TCOS с лабиринтами) планировалась полная переделка под пародию на \"PT\": повторяющиеся переходы, скримеры и новые проходы для решения тех или иных головоломок. После года разработки, выяснилось, что для простой пародии на \"PT\" было сделано слишком много, а игра перестала быть похожей на оригинал. В связи с этим я принял решение перенести эти наработки для проекта \"Unwanted\" как долгострой (в частности карту дома). После ещё одного года (работа производилась уже как над \"Unwanted\"), было решено всё таки оформить её как самостоятельный проект с новым названием - \"Dome Shae\". В конце концов, после такого путешествия между проектами, \"TCOS\" возвращается ко своей изначальной задумке - абстрактный визуал и бесконечные лабиринты. В будущем предстоит переписать этот проект на нашем собственном движке -\"Voltage\", а визуальная составляющая будет переделана в 2.5D.\r\n\r\nБыла мысль в Dome Shae сделать геймплей, где мы играем за Масленникова, ищем паранормальное и снимаем материалы, чтобы продавать их на чёрном рынке. Это предполагало нахождение не только в доме, но и за его пределами: лес, заброшенные здания, стройки...\r\n\r\nИнтересный факт: для обложки релиза Tensor Kinect - Vintage использовался скриншот из этой игры (Dome Shae).\r\n\r\n[tensor.png]\r\n";
}
async function compiledContent() {
	return await html();
}
function getHeadings() {
	return [];
}
var Content = createComponent((result, _props, slots) => {
	const { layout, ...content } = frontmatter;
	content.file = file;
	content.url = void 0;
	return renderTemplate`${maybeRenderHead()}${unescapeHTML(html())}`;
});
//#endregion
export { Content, Content as default, compiledContent, file, frontmatter, getHeadings, rawContent, url };
