import { b as unescapeHTML, d as maybeRenderHead, u as renderTemplate } from "./server_Cu3e08uR.mjs";
import { t as createComponent } from "./global_Ckd2dsnF.mjs";
//#region src/data/news/6.md
var html = () => "<p>Screensaver - это сайт, который решает проблему разрозненности игровых воспоминаний: скриншоты теряются в галереях, мессенджерах и облачных хранилищах, а контекст - с кем, когда и при каких обстоятельствах был сделан снимок - забывается. Мы предлагаем платформу, где каждый скриншот сопровождается богатой системой метаданных, а профиль пользователя становится персонализированным архивом его игровой истории.</p>\n<h2 id=\"концепция\">Концепция</h2>\n<p>Screensaver\xA0- это социальная сеть, где пользователи загружают скриншоты из игр, добавляют к ним подробные метаданные и делятся ими с друзьями и сообществом. Ключевая особенность - структурированная информация о каждом снимке, что позволяет в дальнейшем удобно сортировать, фильтровать и находить нужные моменты. При загрузке изображения пользователь заполняет таблицу метаданных. Все поля необязательны, но желательны, так как от них зависит качество сортировки и поиска:</p>\n<ol>\n<li><strong>Игра</strong> - Название игры, в которой был сделан скриншот</li>\n<li><strong>Плейс / Режим / Сервер</strong> - Конкретное место: например для Roblox - плейс, для Minecraft - сервер, для других игр - режим.</li>\n<li><strong>Платформа</strong> - ПК, консоль или другие устройства.</li>\n<li><strong>Дата снимка</strong> - Когда был сделан скриншот. Использует технологию автоматического подставления алгоритмом из метаданных файла (EXIF, дата создания). При желании пользователь может изменить вручную.</li>\n<li><strong>Предыстория (описание)</strong> - Текстовое описание: что происходило и почему этот момент важен.</li>\n<li><strong>Событие (Event)</strong> - Во время какого события сделан снимок: концерт в Fortnite, день рождения друга, игровой турнир, рейд.</li>\n<li><strong>Кто на скриншоте</strong> - Отметка друзей и других пользователей (Тегирование). Можно выставлять метки в каком месте находился тот или иной человек.</li>\n<li><strong>Кем сделан скриншот</strong> - На тот случай если скриншот был сделан другим человеком. (Это поле может исчезнуть)</li>\n</ol>\n<h2 id=\"страница-пользователя\">Страница пользователя</h2>\n<p>Профиль пользователя — это его личный игровой архив с настраиваемыми параметрами.\r\nНа странице будет отображаться следующая информация:</p>\n<ol>\n<li><strong>Список игр, в которых пользователь делал скриншоты</strong> - Формируется автоматически на основе загруженных снимков, но можно редактировать.</li>\n<li><strong>Псевдоним (Ник)</strong> - Основной псевдоним, отображаемый в профиле.</li>\n<li><strong>“Также известен как”</strong> - Перечень других ников, которые пользователь использовал или использует в разных играх (или за их пределами). Помогает узнавать его в разных проектах.</li>\n<li><strong>Общая библиотека скриншотов</strong> - Отображаются все загруженные скриншоты в виде ленты.</li>\n<li><strong>Тегирование</strong> - если вас отметили на скриншоте, он появляется в вашем профиле в отдельном разделе.</li>\n</ol>\n";
var frontmatter = {
	"theme": "Что такое Screensaver?",
	"preview": "news6.png"
};
var file = "D:/Files/Dev/Web/Tamati/src/data/news/6.md";
var url = void 0;
function rawContent() {
	return "   \r\n                               \r\n                    \r\n   \r\n\r\nScreensaver - это сайт, который решает проблему разрозненности игровых воспоминаний: скриншоты теряются в галереях, мессенджерах и облачных хранилищах, а контекст - с кем, когда и при каких обстоятельствах был сделан снимок - забывается. Мы предлагаем платформу, где каждый скриншот сопровождается богатой системой метаданных, а профиль пользователя становится персонализированным архивом его игровой истории.\r\n\r\n## Концепция\r\n\r\nScreensaver\xA0- это социальная сеть, где пользователи загружают скриншоты из игр, добавляют к ним подробные метаданные и делятся ими с друзьями и сообществом. Ключевая особенность - структурированная информация о каждом снимке, что позволяет в дальнейшем удобно сортировать, фильтровать и находить нужные моменты. При загрузке изображения пользователь заполняет таблицу метаданных. Все поля необязательны, но желательны, так как от них зависит качество сортировки и поиска:\r\n\r\n1. **Игра** - Название игры, в которой был сделан скриншот\r\n2. **Плейс / Режим / Сервер** - Конкретное место: например для Roblox - плейс, для Minecraft - сервер, для других игр - режим.\r\n3. **Платформа** - ПК, консоль или другие устройства.\r\n4. **Дата снимка** - Когда был сделан скриншот. Использует технологию автоматического подставления алгоритмом из метаданных файла (EXIF, дата создания). При желании пользователь может изменить вручную.\r\n5. **Предыстория (описание)** - Текстовое описание: что происходило и почему этот момент важен.\r\n6. **Событие (Event)** - Во время какого события сделан снимок: концерт в Fortnite, день рождения друга, игровой турнир, рейд.\r\n7. **Кто на скриншоте** - Отметка друзей и других пользователей (Тегирование). Можно выставлять метки в каком месте находился тот или иной человек.\r\n8. **Кем сделан скриншот** - На тот случай если скриншот был сделан другим человеком. (Это поле может исчезнуть)\r\n\r\n## Страница пользователя\r\n\r\nПрофиль пользователя — это его личный игровой архив с настраиваемыми параметрами.\r\nНа странице будет отображаться следующая информация:\r\n\r\n1. **Список игр, в которых пользователь делал скриншоты** - Формируется автоматически на основе загруженных снимков, но можно редактировать.\r\n2. **Псевдоним (Ник)** - Основной псевдоним, отображаемый в профиле.\r\n3. **\"Также известен как\"** - Перечень других ников, которые пользователь использовал или использует в разных играх (или за их пределами). Помогает узнавать его в разных проектах.\r\n4. **Общая библиотека скриншотов** - Отображаются все загруженные скриншоты в виде ленты.\r\n5. **Тегирование** - если вас отметили на скриншоте, он появляется в вашем профиле в отдельном разделе.\r\n";
}
async function compiledContent() {
	return await html();
}
function getHeadings() {
	return [{
		"depth": 2,
		"slug": "концепция",
		"text": "Концепция"
	}, {
		"depth": 2,
		"slug": "страница-пользователя",
		"text": "Страница пользователя"
	}];
}
var Content = createComponent((result, _props, slots) => {
	const { layout, ...content } = frontmatter;
	content.file = file;
	content.url = void 0;
	return renderTemplate`${maybeRenderHead()}${unescapeHTML(html())}`;
});
//#endregion
export { Content, Content as default, compiledContent, file, frontmatter, getHeadings, rawContent, url };
