//#region src/data/projects/8.md?raw
var _8_default = "## Описание\r\n\r\nЭто простой, расслабляющий пазл для виртуальной реальности. Игрок находится в уютной мастерской, перед ним - рамка с сеткой, а вокруг разбросаны кубики. На каждом кубике фрагмент изображения. Задача: взять найти кубики и вставить в нужные ячейки и собрать единую картину.\r\n\r\n## Разработка\r\n\r\nЭто был первый VR-проект. Игра создана под предводительство такого товарища под именем Максим Галкин. Игра получилась вся в багах (буквально неиграбельна) и до сих пор не вышла. Планируется довести её до ума, ради своего интереса.\r\n";
//#endregion
export { _8_default as default };
